{ "translations": {
    "Error getting OAuth access token" : "Produciuse un erro ao obter o testemuño de acceso OAuth",
    "Error during OAuth exchanges" : "Produciuse un erro durante os intercambios de OAuth",
    "Github notifications" : "Notificacións de GitHub",
    "GitHub issues and pull requests" : "Incidencias (issues) e solicitudes de extracción (pull requests) de GitHub",
    "GitHub repositories" : "Repositorios de GitHub",
    "Bad credentials" : "Credenciais incorrectas",
    "OAuth access token refused" : "Foi rexeitado o testemuño de acceso de OAuth",
    "Connected accounts" : "Contas conectadas",
    "GitHub integration" : "Integración de GitHub",
    "Integration of GitHub software development management service" : "Integración do servizo de xestión de desenvolvemento de software GitHub",
    "GitHub integration provides a dashboard widget displaying your important notifications and a unified search provider to search for repositories, issues and pull requests." : "A integración de GitHub fornece un trebello de panel que amosa as súas notificacións importantes e un provedor de busca unificado para buscar repositorios, incidencias (issues) e solicitudes de extracción (pull requests).",
    "If you want to allow your Nextcloud users to use OAuth to authenticate to https://github.com, create an OAuth application in your GitHub settings." : "Se quere permitir que os seus usuarios do Nextcloud usen OAuth para autenticarse en https://github.com, cree unha aplicación OAuth nos axustes de GitHub.",
    "GitHub OAuth settings" : "Axustes do OAuth de GitHub",
    "Set \"Application name\", \"Homepage URL\" and \"Application description\" to values that will make sense to your Nextcloud users as they will see them when connecting to GitHub using your OAuth app." : "Estableza o «Nome da aplicación», «URL de inicio» e a «'Descrición da aplicación» a valores que teñán sentido para os seus usuarios do Nextcloud, xa que os verán cando se conecten a GitHub usando a súa aplicación OAuth.",
    "Make sure you set the \"Authorization callback URL\" to" : "Asegúrese de establecer o «URL de devolución de chamada de autorización» como",
    "Put the OAuth app \"Client ID\" and \"Client secret\" below." : "Poña  o «ID de cliente» e o «Segredo do cliente» da aplicación OAuth a seguir.",
    "Your Nextcloud users will then see a \"Connect to GitHub\" button in their personal settings." : "Os seus usuarios do Nextcloud verán entón un botón «Conectar co GitHub» nos seus axustes persoais.",
    "Client ID" : "ID do cliente",
    "Client ID or your GitHub application" : "ID do cliente ou a súa aplicación de GitHub",
    "Client secret" : "Segredo do cliente",
    "Client secret or your GitHub application" : "Segredo do cliente ou a súa aplicación de GitHub",
    "GitHub admin options saved." : "Gardáronse as opcións de administración de GitHub.",
    "When you create a personal access token yourself, give it at least \"read:user\", \"user:email\" and \"notifications\" permissions." : "Cando vostede cree un testemuño de acceso, déalle polo menos os permisos «read:user», «user:email» e «notifications».",
    "Personal access token" : "Testemuño de acceso persoal",
    "GitHub personal access token" : "Testemuño de acceso persoal ao GitHub",
    "Connect to GitHub" : "Conectar co GitHub",
    "Connected as {user}" : "Conectado como {user}",
    "Disconnect from GitHub" : "Desconectar de GitHub",
    "Enable searching for repositories, issues and pull requests." : "Activar a busca de repositorios, incidencias (issues) e solicitudes de extracción (pull request).",
    "Warning, everything you type in the search bar will be sent to GitHub." : "Advertencia, todo o que escriba na barra de buscas enviarase a GitHub.",
    "GitHub OAuth access token successfully retrieved!" : "Recuperouse correctamente o testemuño de acceso OAuth de GitHub.",
    "GitHub OAuth error:" : "Erro do OAuth de GitHub:",
    "GitHub options saved." : "Gardáronse as opcións de GitHub.",
    "Incorrect access token." : "Testemuño de acceso incorrecto",
    "Failed to save GitHub OAuth state" : "Produciuse un fallo ao gardar o estado do OAuth de GitHub",
    "GitHub notifications" : "Notificacións de GitHub",
    "Mark as read" : "Marcar como lido",
    "Unsubscribe" : "Desubscribir",
    "No GitHub account connected" : "Non hai ningunha conta de GitHub conectada",
    "Error connecting to GitHub" : "Produciuse un erro ao conectar co GitHub",
    "No GitHub notifications!" : "Non hai notificacións de GitHub.",
    "Failed to get GitHub notifications." : "Produciuse un fallo ao obter as notificacións de GitHub.",
    "Failed to edit GitHub notification." : "Produciuse un fallo ao editar a notificación de GitHub.",
    "You were mentioned in a pull request" : "Vostede foi mencionado nunha solicitude de extracción (Pull request)",
    "You were mentioned in an issue" : "Vostede foi mencionado nunha incidencia (issue)",
    "Comment" : "Comentario",
    "Your review was requested" : "Foi solicitada a súa revisión",
    "Pull request state changed" : "Cambiouse o estado de solicitude de extracción (Pull request)",
    "Issue state changed" : "Cambiouse o estado da incidencia (issue)",
    "You are assigned" : "Foi asignado"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}