{ "translations": {
    "GitHub" : "GitHub",
    "Error getting OAuth access token" : "Errore recuperende su token de intrada OAuth.",
    "Error during OAuth exchanges" : "Errore in su negòssiu OAuth",
    "GitHub notifications" : "Notìficas GitHub",
    "GitHub issues and pull requests" : "Problemas e rechestas de pull de GitHub",
    "GitHub repositories" : "Magasinu GitHub ",
    "Bad HTTP method" : "Mètodu HTTP malu",
    "Bad credentials" : "Credentziales non bàlidas",
    "OAuth access token refused" : "Token de intrada OAuth refudadu",
    "Connected accounts" : "Contos connètidos",
    "GitHub integration" : "Integratzione cun GitHub",
    "Integration of GitHub software development management service" : "Integratzione cun su sercìtziu de contròllu de isvilupu de su programa Github ",
    "GitHub integration provides a dashboard widget displaying your most important notifications\n    and a unified search provider for repositories, issues and pull requests." : "S'integratzione cun GitHub oferit unu trastu de pannellu de controllu chi mustrat is notificatziones tuas de majore importu\n   e unu frunidore de chirca unificada pro magasinos, un proveedor de búsqueda unificada para repositorios, problemas e rechestas de pull.",
    "If you want to allow your Nextcloud users to use OAuth to authenticate to https://github.com, create an OAuth application in your GitHub settings." : "Si cheres permìtere chi is utentes tuos de Nextcloud impreent OAuth pro s'identificare cun https://github.com, crea una aplicatzione OAuth in sa cunfiguratzione tua de GitHub",
    "GitHub OAuth settings" : "Configuratzione OAuth de GitHub",
    "Set \"Application name\", \"Homepage URL\" and \"Application description\" to values that will make sense to your Nextcloud users as they will see them when connecting to GitHub using your OAuth app." : "Imposta: «Nùmene de s'aplicatzione», «URL de sa pàgina de cumintzu» e «Descritzione de s'aplicatzione» cun balores chi tèngiant sentidu pro is utentes tuos de Nextcloud tando ddos ant a bìdere cando s'ant a connètere a GitHub impreende s'aplicatzione tua OAuth.",
    "Make sure you set the \"Authorization callback URL\" to" : "Segura·ti de cunfigurare sa «URL de torrare a cramare» comente",
    "Put the OAuth app \"Client ID\" and \"Client secret\" below." : "Pone su «ID de su cliente» e su «Segretu de cliente» de s'aplicatzione OAuth sighende.",
    "Your Nextcloud users will then see a \"Connect to GitHub\" button in their personal settings." : "Is utentes de Nextcloud ant a bìdere unu butone pro «Connète·ti a GitHub» in sa cunfiguratzione personale.",
    "Client ID" : "ID cliente",
    "Client ID of your GitHub application" : "ID de su cliente de s'aplicatzione tua de GitHub",
    "Client secret" : "Cliente segretu",
    "Client secret of your GitHub application" : "Segretu de cliente de s'aplicatzione de GitHub",
    "GitHub admin options saved" : "Optziones de aministratzione de Github sarvadas",
    "Failed to save GitHub admin options" : "Errore sarvende is sèberos de amministratzione de Github",
    "When you create a personal access token yourself, give it at least \"read:user\", \"user:email\" and \"notifications\" permissions." : "Cando as a creare tue etotu unu token de intrada personale, dae·li a su mancu is permisos «read:user», «user:email» y «notifications».",
    "GitHub personal access tokens" : "Tokens de intrada personales de GitHub",
    "Enable navigation link" : "Ativa su ligòngiu de navigatzione",
    "Personal access token" : "Token de intrada personale",
    "GitHub personal access token" : "Token de intrada personale a GitHub",
    "Connect to GitHub" : "Connète a GitHub",
    "Connected as {user}" : "Connètidu comente {user}",
    "Disconnect from GitHub" : "Disconnete de GitHub",
    "Enable searching for repositories" : "Ativa sa chirca de magasinos",
    "Enable searching for issues and pull requests" : "Ativa sa chirca de problemas e rechestas de pull",
    "Warning, everything you type in the search bar will be sent to GitHub." : "Avisu: totu su chi iscries in s'istanca de chirca s'at a imbiare a GitHub.",
    "Connected to GitHub!" : "Connètidu a GitHub!",
    "GitHub OAuth error:" : "Errore OAuth de Github:",
    "GitHub options saved" : "Sèberos de GitHub sarvados",
    "Failed to save GitHub options" : "No at fatu a sarvare is sèberos de GitHub",
    "Mark as read" : "Marca comente lèghidu",
    "Unsubscribe" : "Disiscrie·ti",
    "No GitHub account connected" : "No b'at contos de GitHub connètidos",
    "Error connecting to GitHub" : "Errore connetende·si a GitHub",
    "No GitHub notifications!" : "No b'at notìficas de GitHub!",
    "Failed to get GitHub notifications" : "No at fatu a otènnere is notìficas de GitHub",
    "Successfully unsubscribed" : "Disiscritu in manera curreta",
    "Failed to edit GitHub notification" : "No at fatu a modificare sa notìfica de GitHub",
    "Failed to save GitHub OAuth state" : "No at fatu a sarvare s'istadu OAuth de GitHub"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}